src/cf/Catalogs/fmRoutePointsStates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmRoutePointsStates</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.fmRoutesPoints</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ColorType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Green</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Red</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Blue</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Color</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StageCompleted</Name>
					<Comment>0 - этап отклонен; 1 - этап согласован; 2 - согласование прекращено;</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDocumentState</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ColorStorage</Name>
					<Comment>Цвет хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReturnPoint</Name>
					<Comment>Точка возврата на предыдущий уровень</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.fmRoutesPoints</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TransitionPoint</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmRoutesPoints</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/fmRoutePointsStates/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Процедура обработчик "ОбработкаЗаполнения" 
//
Procedure Filling(FillingData, StandardProcessing)
	
	If IsNew() Then
		RndGen      = New RandomNumberGenerator();
		Red  = RndGen.RandomNumber(0, 255);
		Blue    = RndGen.RandomNumber(0, 255);
		Green  = RndGen.RandomNumber(0, 255);
		ColorType = NStr("en='Absolute';ru='Абсолютный'");
	EndIf;
	
EndProcedure

// Процедура обработчик "ОбработкаПроверкиЗаполнения" 
//
Procedure FillCheckProcessing(Cancel, CheckingAttributes)
	
	If DataExchange.Load Then
		Return;
	EndIf;
		
	// Проверим, чтобы указанная точка возврата была из списка возможных точек возврата.
	If StageCompleted = 0 AND ValueIsFilled(ReturnPoint)
	AND fmProcessManagement.GettingPreviousStagesList(Owner, 1).Find(ReturnPoint) = Undefined Then
		CommonClientServer.MessageToUser(NStr("en='The specified return point is not included in possible return points of the selected route point.';ru='Указанная точка возврата не входит в возможные точки возврата выбранной точки маршрута!'"), , , , Cancel);
	EndIf;
	
	If StageCompleted = 0 AND Owner.PointsPredecessors.Count() = 0 Then
		CommonClientServer.MessageToUser(NStr("en='For the route start point, the returning to the previous level status is prohibited.';ru='Для начальной точки маршрута не допустимо состояния с возвратом на предыдущий уровень!'"), , , , Cancel);
	EndIf;
	
EndProcedure
